In [1]:
from pandas import DataFrame

In [3]:
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                    'altitde':[3158,3000,2752]})

In [4]:
dframe

         city  altitde
0        Alma     3158
1  Brian Head     3000
2    Fox Park     2752

In [5]:
state_map = {'Alma':'Colorado','Brian Head':'Utah', 'Fox Park':'Wyoming'}

In [6]:
dframe['state'] = dframe['city'].map(state_map)

In [7]:
dframe

         city  altitde     state
0        Alma     3158  Colorado
1  Brian Head     3000      Utah
2    Fox Park     2752   Wyoming

In [8]:
dframe['key1'] = [0,1,2]

In [9]:
dframe

         city  altitde     state  key1
0        Alma     3158  Colorado     0
1  Brian Head     3000      Utah     1
2    Fox Park     2752   Wyoming     2